li = ['2.5톤', '5톤', '9.5톤', '10톤', '27톤',
      'K-1', 'K1a1', 'k10탄약운반차', 'K56', 'K77',
      'K288a1', 'K200', 'K800', 'km9ace', '교량전차',
      '다목적굴착기', '대형버스', '부식차', '살수차', '승용차',
      '장애물개척자', '통신가설차량', '화생방정찰차'] # 중분류, 소분류

def Class_ins(t):
      if t in (5, 6):
            return f'중분류 : 전차 소분류 : {li[t]}'
      elif t in (7, 8, 9, 10, 11, 12, 13, 14, 20, 22):
            return f'중분류 : 궤도/장갑차 소분류 : {li[t]}'
      elif t in (0, 1, 2, 3, 4, 15, 16, 17, 18, 19, 21):
            return f'중분류 : 차륜 전투차량 소분류 : {li[t]}'